projects/case-c8f6a7a7/working/night_optimization/foam_candidates/candidate-1cbcc8e7/working/openfoam_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          673;
        startFace       355803;
    }
    outlet
    {
        type            patch;
        nFaces          1068;
        startFace       356476;
    }
    farField
    {
        type            patch;
        nFaces          4286;
        startFace       357544;
    }
    hull
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          24427;
        startFace       361830;
    }
)

// ************************************************************************* //
